[
    {
        "TeamMemberImg": "/Jon-Van-Caneghem.jpg",
        "name": "Jon Van Caneghem",
        "designation": "Co-Founder and Co-CEO",
        "linkedin_profile": "https://www.linkedin.com/in/jon-van-caneghem-ab3a773/",
        "TeamMemberDetails": "JVC is a Games industry Hall of Fame Designer / Director / Producer having personally created two world-renowned franchises: The Might and Magic® role-playing series and the Heroes® strategy series. He is an industry pioneer with over 35 years in designing, directing, producing, and publishing entertainment software. He is the Founder of three startups including two exits, complemented by experienced Sr. Executive roles at four public companies (3DO, NCSOFT, EA, and Tencent). Most recently, Jon served as the Head of N. America R&D Studios at Tencent. Prior to Tencent, Jon was the Founder/CEO of VC Mobile Entertainment, VP at Electronic Arts where he led multiple internal studios including running the Command & Conquer franchise, and as Co-Founder/Chief Creative Officer at Trion Worlds led the development of Rift. Prior to Trion, Jon was the Founder/CEO of New World Computing, which he ran for 20+ years and created/published the Might and Magic series and ultimately saw a successful sale to 3DO."
    },
    {
        "TeamMemberImg": "/Jack-Sheng.jpg",
        "name": "Jack Sheng",
        "designation": "Co-Founder and Co-CEO",
        "linkedin_profile": "https://www.linkedin.com/in/jack-sheng-2717358/",
        "TeamMemberDetails": "Prior to DIG, Jack served as the Director of Int’l Partnerships at Tencent, the world’s largest gaming company, focusing on strategic investments, business development, and strategy. While at Tencent, Jack was involved as a board observer at numerous Mobile and AAA video game portfolio companies and gained significant operations expertise from working on various strategic initiatives. Jack started his career on Wall Street in traditional finance, including covering Tech stocks as a Research Analyst in the Global Investment Research division of Goldman Sachs. Additionally, Jack spent time on the buy-side in the hedge fund industry focusing on Gaming alongside Global Tech, Media, and Telecom sectors as a Vice President at AllianceBernstein. He received a B.S. in Economics degree with a concentration in Finance and graduated magna cum laude from the Wharton School of the University of Pennsylvania."
    }
]